#=================================================
# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
# תרגיל 2: יצירת עץ צומת
#=================================================

#Class Node היא היחידה הבסיסית בעץ
class Node:
    def __init__(self,data):
        self.data = data      # מלא את הצמתים
        self.left = None      # ילד עזב
        self.right = None     # ילד נכון

#יצירת שורש
root = Node('A')          # עץ שורש

#צור ילד רמה 1
root.left = Node('B')     # שורש ילד שמאל
root.right = Node('C')    # הילד הנכון של שורש

#צור ילד רמה 2
root.left.left = Node('D')   # הילד השמאלי של ב'
root.left.right = Node('E')  # הילד הנכון של ב'

#מציג את תוכן הצומת
print('נתונים על שורש', root.data)            # הצג שורש
print('שורש נתונים שמאלה', root.left.data)       # מוצג שורש שמאל
print('שורש נתונים נכון', root.right.data)     # הצג שורש ימני
print('נתונים שורש שמאלי שמאלה', root.left.left.data)    # מוצג צומת D
print('שורש שמאל ימין נתונים', root.left.right.data)   # מוצג צומת E

#הסבר

# איך זה עובד: קודם יוצרים את השורש, ואז ממלאים בשכבות את הילדים השמאלי והימני.
# כל הדפסה משמשת לבדיקת תוכן הצומת מלמעלה למטה ומשמאל לימין.
