#=================================================
# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
# תרגיל 6: מבנה ארגוני של החברה
#=================================================
class Node:
    def __init__(self,data):
        self.data = data      # מלא את הצמתים
        self.left = None      # ילד עזב
        self.right = None     # ילד נכון

#פונקציית מעבר בהזמנה מראש
def preorder(node):
    if node is not None:
        print(node.data)      # הצג נתוני צומת
        preorder(node.left)   # המשך שמאלה
        preorder(node.right)  # המשך ימינה

#צור עץ מבנה ארגוני
root = Node('במאי')   # המנהיג הכי גבוה

#ילד רמה 1
root.left = Node('מנהל א')   # סניף שמאל
root.right = Node('מנהל ב')  # סניף ימני

#ילד רמה 2
root.left.left = Node('צוות 1')   # צוות תחת א
root.left.right = Node('צוות 2')  # צוות תחת א

root.right.left = Node('צוות 3')  # הסגל התחתון של ב'


#הפעלת מעבר הזמנה מראש
print('מבנה ארגוני (הזמנה מראש):')  # כותרת התוצאה
preorder(root)                              # הצג עץ

# איך זה עובד: המבנה הארגוני מצויר כעץ, ואז הזמנה מראש מציגה תחילה את המנהיגים.
# לאחר מכן, התוכנית נכנסת לסניפי המנהל והצוות משמאל לימין.