#=================================================
# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
# תרגיל 2: צור עץ חיפוש בינארי
#=================================================

#Class Node היא היחידה הבסיסית בעץ
class Node:
    def __init__(self,data):
        self.data = data      # מלא את הצמתים
        self.left = None      # ילד עזב
        self.right = None     # ילד נכון

#פונקציית מעבר בהזמנה מראש
def preorder(node):
    if node is not None:
        print(node.data, end=" ")  # בקר בצמתים
        preorder(node.left)         # המשך שמאלה
        preorder(node.right)        # המשך ימינה


#צור עץ
root = Node('A')          # עץ שורש

#צור ילד רמה 1
root.left = Node('B')     # שורש ילד שמאל
root.right = Node('C')    # הילד הנכון של שורש

#צור ילד רמה 2
root.left.left = Node('D')   # השאיר ילד ב
root.left.right = Node('E')   # הילד הנכון של ב'


#הפעלת עסקאות הזמנה מראש
print('תוצאות עסקה בהזמנה מראש:')  # כותרת התוצאה
preorder(root)                         # הפעל הזמנות מראש

#הסבר:
#1. קרא תחילה את הצומת הנוכחי.
#2. ממשיכים לסניף השמאלי.
#3. לבסוף לכו לסניף הימני.

# איך זה עובד: הזמנה מראש תמיד מעבדת תחילה את הצומת הנוכחי, ואז רקורסיבית שמאלה וימינה.
# התוצאה היא שסדר הביקורים עוקב אחר שורש הדפוס -> שמאל -> ימין.