#=================================================
# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
# תרגיל 4: צור עץ חיפוש בינארי
#=================================================
class Node:
    def __init__(self,data):
        self.data = data      # מלא את הצמתים
        self.left = None      # ילד עזב
        self.right = None     # ילד נכון

#צור פונקציית סדר: שמאל -> שורש -> ימין
def inorder(node):
    if node is not None:
        inorder(node.left)          # בקר משמאל
        print(node.data, end=" ")  # בקר בצמתים
        inorder(node.right)         # בקר נכון

#צור עץ
root = Node('A')          # עץ שורש

#צור ילד רמה 1
root.left = Node('B')     # שורש ילד שמאל
root.right = Node('C')    # הילד הנכון של שורש

#צור ילד רמה 2
root.left.left = Node('D')   # השאיר ילד ב
root.left.right = Node('E')  # הילד הנכון של ב'


print('תוצאות רוחביות לא מסודרות:')  # כותרת התוצאה
inorder(root)                         # רץ לפי הסדר

#הסבר:
#1. קרא תחילה את הענף השמאלי.
#2. לאחר מכן קרא את הצומת הנוכחי.
#3. סוף סוף קרא את הענף הנכון.

# איך זה עובד: אין-סדר חוצה את תת-העץ השמאלי, לאחר מכן את הצמתים, ואז את תת-העץ הימני באופן רקורסיבי.
# סדר ההופעה שימושי לצפייה בנתונים לפי מיקום משמאל לימין בעץ.