#===================================
# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
#תרגיל 1: יצירת צמתים
#===================================

class Node:
    def __init__(self,data):
        self.data = data      # מלא את הצמתים
        self.left = None      # ילד עזב
        self.right = None     # ילד נכון
#יצירת שורש

root = Node('A')          # עץ שורש

#מציג את תוכן הצומת
print('נתונים על שורש', root.data)  # הצג נתוני שורש

# איך זה עובד: המחלקה Node מאחסנת נתונים ושני ילדים, ואז נוצר שורש עם התוכן 'A'.
# תוכנית זו מציגה רק נתונים על השורש כדוגמה לצומת הבסיסי ביותר.
