#=================================================
# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
# תרגיל 5: צור עץ חיפוש בינארי
#=================================================
class Node:
    def __init__(self,data):
        self.data = data      # מלא את הצמתים
        self.left = None      # ילד עזב
        self.right = None     # ילד נכון

#צור פונקציית סדר: שמאל -> שורש -> ימין
def postorder(node):
    if node is not None:
        postorder(node.left)        # בקר משמאל
        postorder(node.right)       # בקר נכון
        print(node.data, end=" ")  # בקר בצמתים


#צור עץ
root = Node('A')          # עץ שורש

#צור ילד רמה 1
root.left = Node('B')     # שורש ילד שמאל
root.right = Node('C')    # הילד הנכון של שורש

#צור ילד רמה 2
root.left.left = Node('D')   # השאיר ילד ב
root.left.right = Node('E')  # הילד הנכון של ב'

#צור ילד ברמה 3
root.left.left.left = Node('F')  # שמאל ילד ד


print('תוצאות רוחביות לא מסודרות:')  # כותרת התוצאה
postorder(root)                       # בצע הזמנה לפוסט

#הסבר:
#1. קרא תחילה את הענף השמאלי.
#2. לאחר מכן קרא את הענף הנכון.
#3. לבסוף קרא את הצומת הנוכחי.

# איך זה עובד: הזמנה לאחר עיבוד מעבד את כל הילדים השמאליים, ואז הילדים הימניים, ואז צומת האב.
# דפוס זה מתאים כאשר נתוני הורה חדשים עשויים להיות מעובדים לאחר השלמת כל הילדים.
