#=================================================
#שם = Muhammad Omar Ibrahim
#מספר סטודנט = J0403251093
#כיתה = TPL B1
#=================================================

# ==========================================================
# דוגמה 2 לחזרה לאחור: שילוב בינארי עם מגבלה '1' (גיזום)
# ==========================================================
def biner_batas(n, batas, hasil="", jumlah_1=0):
# גיזום: אם count_1 חצה את הגבול, עצור
    if jumlah_1 > batas:
        return
# מארז בסיס
    if len(hasil) == n:
        print(hasil)
        return
# בחר '0'
    biner_batas(n, batas, hasil + "0", jumlah_1)
    # בחר '1'
    biner_batas(n, batas, hasil + "1", jumlah_1 + 1)


biner_batas(4, 2)