#=================================================
#שם = Muhammad Omar Ibrahim
#מספר סטודנט = J0403251093
#כיתה = TPL B1
#=================================================

#=================================================
# חומר רקורסיבי: פקטוריאלי
# מקרה רקורסיבי => 3! = 3x2x1
# מקרה בסיס => 0 עצירה
#=================================================

def faktorial(n):
    #מקרה בסיסי מפסיק כאשר n == 0
    if n==0:
        return 1

    #בעיית מקרה רקורסיבי מצטמצמת ל-n-1 פקטוריאלית
    return n*faktorial(n-1)


print('=========== מונה גורמים =================')
print('תוצאות פקטוריאליות:', faktorial(int(input('הכנס את המספרים שלך:'))))
