# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

# ==========================================================
# תרגיל 4: שילובי אותיות (חזרה בסיסית)
# ==========================================================

def kombinasi(n, hasil=""):

    # מקרה בסיס (מצב עצירה)
    # אם אורך מחרוזת ה'תוצאה' כבר שווה ל-n,
    # אז השילוב הושלם
    if len(hasil) == n:
        print(hasil)   # שילוב הדפסה
        return         # בטל את הסניף הזה

    # מקרה רקורסיבי (בחר וחקור)

    # אפשרות 1: הוסף את האות "A"
    kombinasi(n, hasil + "A")

    # אפשרות 2: הוסף את האות "B"
    kombinasi(n, hasil + "B")


# שילוב מתחיל עם אורך 2
kombinasi(2)