# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

# ==========================================================
# תרגיל 2: מעקב אחר רקורסיה
# ==========================================================

def countdown(n):

    # מקרה בסיס (מצב עצירה)
    # אם n כבר 0, הדפס "בוצע"
    # ואז עצור את הפונקציה עם החזרה
    if n == 0:
        print('בוצע')
        return

    # סעיף זה מבוצע כאשר נכנסים לפונקציה
    # לפני השיחה הרקורסיבית הבאה
    print("Masuk:", n)

    # קריאה רקורסיבית
    # הפונקציה קוראת לעצמה
    # עם ערך n קטן יותר (n - 1)
    countdown(n - 1)

    # סעיף זה מבוצע בעת יציאה מהפונקציה
    # כלומר לאחר סיום השיחה הרקורסיבית
    print("Keluar:", n)


# התחלת תהליך הרקורסיה
countdown(3)