# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

# ==========================================================
# תיאור מקרה: מחולל PIN בן 3 ספרות (0–2)
# ==========================================================

def buat_pin(panjang, hasil=""):

    # מארז בסיס
    # אם אורך מחרוזת 'התוצאה' זהה לאורך ה-PIN,
    # אז ה-PIN שלם ומוכן להדפסה
    if len(hasil) == panjang:
        print("PIN:", hasil)
        return

    # מקרה רקורסיבי
    # נסה כל מספר אפשרי (בחר)
    for angka in ["0", "1", "2"]:

        # חקור ← הוסף מספרים לתוצאות הנוכחיות
        buat_pin(panjang, hasil + angka)


# צור PIN בן 3 ספרות
buat_pin(3)