#=================================================
#שם = Muhammad Omar Ibrahim
#מספר סטודנט = J0403251093
#כיתה = TPL B1
#=================================================

#=================================================
# חומר רקורסיבי: Call Stack
# מעקב אחר מספרים (בפנים)
# קלט 3
# הזן 1 - 2 - 3
# מחוץ 3 - 2 - 1
#=================================================

def hitung(n):

    #מארז בסיס
    if n==0:
        print('בוצע')
        return

    print('כניסה:', n)
    hitung(n-1) #מקרה רקורסיבי
    print('יציאה:', n)


print('=========תוכנית מעקב===========')
hitung(int(input('הזן את המספר שברצונך לבצע טריז:')))
