# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

# ==========================================================
# תרגיל 3: מציאת הערך המקסימלי (רקורסיה ברשימה)
# ==========================================================

def cari_maks(data, index=0):

    # מקרה בסיס (מצב עצירה)
    # אם האינדקס כבר נמצא ברכיב האחרון של הרשימה,
    # לאחר מכן החזר מיד את הערך של אותו אלמנט
    # כי אין מה להשוות.
    if index == len(data) - 1:
        return data[index]

    # מקרה רקורסיבי
    # הפונקציה קוראת לעצמה לחפש
    # הערך המקסימלי של הרשימה הנותרת (אינדקס + 1 עד הסוף)
    maks_sisa = cari_maks(data, index + 1)

    # לאחר קבלת המקסימום מהרשימה שנותרה,
    # השוואה עם האלמנט הנוכחי (נתונים[אינדקס])
    if data[index] > maks_sisa:
        return data[index]   # אם האלמנט הנוכחי גדול יותר
    else:
        return maks_sisa     # אם השארית המקסימלית גדולה יותר


# הנתונים שעבורם יחפשו את הערך המקסימלי
angka = [3, 7, 2, 9, 5]

# קריאת פונקציה
print('ערך מקסימלי:', cari_maks(angka))