#=================================================
#שם = Muhammad Omar Ibrahim
#מספר סטודנט = J0403251093
#כיתה = TPL B1
#=================================================

# ==========================================================
# דוגמה 1 לחזרה לאחור: שילוב בינארי (n)
# ==========================================================
def biner(n, hasil=""):
    # מקרה בסיסי: אם אורך המחרוזת הוא n, הדפס את התוצאה
    if len(hasil) == n:
        print(hasil)
        return

    # בחר + חקור: הוסף '0'
    biner(n, hasil + "0")
    # בחר + חקור: הוסף '1'
    biner(n, hasil + "1")

biner(3)