#=================================================
#שם = Muhammad Omar Ibrahim
#מספר סטודנט = J0403251093
#כיתה = TPL B1
#=================================================

#=================================================
# חומר רקורסיבי: הוספת רכיבי רשימה
#=================================================

def jumlah_list(data,index=0):
    #מקרה בסיסי: אם האינדקס הגיע לאורך הרשימה
    if index == len(data):
        return 0
    #מקרה רקורסיבי : אלמנט נוכחי + מספר אלמנטים אחרי
    return data[index] + jumlah_list(data,index+1)

print('==============תוכנית כמות נתונים============')
print(jumlah_list([2,4,5,6,8]))