# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

# ==========================================================
# תרגיל 1: רקורסיית דירוג
# ==========================================================

def pangkat(a, n):
    # מקרה בסיס (מצב עצירה)
    # אם עוצמה = 0, התוצאה היא תמיד 1
    # (מכיוון שלכל מספר יש את החזקה 0 = 1)
    if n == 0:
        return 1

    # מקרה רקורסיבי (קורא לפונקציה עצמה)
    # a^n = a * a^(n-1)
    # הפונקציה תמשיך לקרוא לעצמה
    # כאשר הערך n מופחת ב-1
    return a * pangkat(a, n - 1)

# קריאת פונקציה
print(pangkat(2, 4))  # יציאות: 16