# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

def insertion_sort(data):
    # לולאה מהאלמנט השני לאחרון
    for i in range(1, len(data)):
        key = data[i]  # האלמנט שברצונך למקם נמצא במיקום הנכון
        j = i - 1      # אינדקס האלמנט הקודם

        # העבר אלמנטים גדולים מהמפתח ימינה
        while j >= 0 and data[j] > key:
            data[j + 1] = data[j]  # העבר את האלמנט ימינה
            j -= 1                 # עבור לאלמנט הקודם

        # הנח את המפתח במיקום הנכון
        data[j + 1] = key

    # החזר את הרשימה הממוינת
    return data
'שאלה:\n1. מדוע הלולאה מתחילה ממדד 1?\n2. מה תפקידו של משתנה המפתח?\n3. למה להשתמש בעוד, לא עבור?\n4. אילו פעולות מתרחשות תוך זמן?'

'תשובה:\n1. האלמנט הראשון (אינדקס 0) נחשב לממוין, החל ממדד 1.\n2. מפתח מאחסן את הערך של האלמנט הנוכחי למיון.\n3. בעוד להזיז אלמנטים מכיוון שמספר האיטרציות אינו ודאי, עבור דורש מספר קבוע.\n4. העבר את האלמנט ימינה (data[j+1] = data[j]) ו-j -= 1 עד למיקום הנכון.'