# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

def insertion_sort(data):
    #הלולאה מתחילה מהנתונים השניים (אינדקס המערך הראשון)
    for i in range(1,len(data)):

        #הצג נתונים ראשוניים
        print('נתונים ראשוניים:', data)
        print('='*50)


        key = data[i]#שמור את הערך שהוכנס
        j = i-1 #אינדקס של האלמנט האחרון משמאל

        #איטרציה ל
        print('חזור ל:', i)
        print('ערך מפתח:', key)
        print('חלק שמאל (לפי הסדר):', data[:i])
        print('חלק ימין (לא ממוין):', data[i:])

        #שקופית
        while j >= 0 and key < data[j]:
            data[j+1] = data[j]
            j -= 1
        #הכנס את המפתח למצב הנכון
        data[j+1] = key
        print('לאחר הכנסת:', data)
        print("-"*50)
    return data

data = [5, 2, 4, 6, 1, 3]
print('נתונים לאחר מיון:', insertion_sort(data))

'1. רשום את תוכן הרשימה לאחר איטרציה i = 1.\n2. רשום את תוכן הרשימה לאחר איטרציה i = 3.\n3. כמה פעמים ההיסט מתרחש באיטרציה i = 4?'

'תשובה לשאלה:\n1. [2,5,4,6,1,3]\n2. [2,4,5,6,1,3]\n3. 4 פעמים, כי 1 מוזז שמאלה מעבר ל-6,5,4,2'