#===============================================================
# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
#================================================================

#================================================================
#מיון הכנסה (עולה)
#================================================================

def insertion_sort(data):
    #הלולאה מתחילה מהנתונים השניים (אינדקס המערך הראשון)
    for i in range(1,len(data)):
        key = data[i]#שמור את הערך שהוכנס
        j = i-1 #אינדקס של האלמנט האחרון משמאל

        #שקופית
        while j >= 0 and key < data[j]:
            data[j+1] = data[j]
            j -= 1
        #הכנס את המפתח למצב הנכון
        data[j+1] = key
    return data


angka=[7,8,5,2,4,6]
print('נתונים לפני מיון:', angka)
print('נתונים לאחר מיון:', insertion_sort(angka))