# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
# כיתה : TPL B1
# מעשי 13 - גרף III: עץ משתרע

# רשימה של קצוות גרף
edges = [
('A', 'B'),
('A', 'C'),
('A', 'D'),
('C', 'D'),
('B', 'D')
]
# דוגמה לעץ פורש
spanning_tree = [
('A', 'C'),
('C', 'D'),
('D', 'B')
]
print('קצה בגרף:')
for edge in edges:
    print(edge)

print('עץ משתרע:')
for edge in spanning_tree:
    print(edge)

print('מספר קצוות הגרף =', len(edges))
print('מספר קצוות עצים פורשים =', len(spanning_tree))


# שאלות ניתוח:
# 1. מה ההבדל בין גרף ראשוני לעץ פורש?
# 2. למה לעץ פורש לא יכולים להיות מחזורים?
# 3. מדוע מספר קצוות העצים הפורשים תמיד קטן?

# תשובה לניתוח:

# 1. ההבדל בין הגרף הראשוני לעץ הפורש הוא
# שלגרף הראשוני יכולים להיות יותר קצוות ו
# עשויים להיות מחזורים, ואילו עץ פורש כן
# תת-גרף המחבר את כל הקודקודים ללא
# יצירת מחזור.

# 2. עצים משתרעים לא יכולים להיות מחזורים בגלל
# המטרה העיקרית של עץ פורש היא
# לחבר את כל הקודקודים עם אותו מספר של קצוות
# מינימום. אם יש מחזור, אז יש קצה שהוא לא
# הכרחי כדי לשמור על קישוריות, אז
# לא יעיל.

# 3. מספר קצוות עצים פורשים תמיד קטן
# כי עץ פורש כולל רק קצוות
# נדרש לחבר את כל הקודקודים ללא לולאות.