# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093
# כיתה : TPL B1
# מעשי 13 - גרף III: עץ משתרע

# תוכנית זו משתמשת באלגוריתם פשוט של Kruskal
# כדי למצוא את ה-Minimal Spanning Tree (MST).

# רשימת קצה: (משקל, node1, node2)
# משקל מציג את הערך/מרחק בין צמתים.
edges = [
    (1, 'C', 'D'),
    (2, 'A', 'C'),
    (3, 'B', 'D'),
    (4, 'A', 'B'),
    (5, 'A', 'D')
]

# ממיין קצוות לפי המשקל הקטן ביותר
# כך שהקצה בעל המשקל הקטן ביותר יעובד ראשון.
edges.sort()

# mst משמש לאחסון הקצה שנבחר
# כחלק מעץ טווח מינימלי.
mst = []

# total_weight משמש לחישוב המשקל הכולל של ה-MST.
total_weight = 0

# מחובר משמש לאחסון צמתים שכבר מחוברים.
connected = set()

# בדוק כל קצה שעבר מיון.
for weight, u, v in edges:
    # קצה נבחר אם אחד מהצמתים עדיין לא מחובר.
    # המטרה היא לא ליצור מעגל פשוט.
    if u not in connected or v not in connected:
        # הוסף קצוות ל-MST.
        mst.append((u, v, weight))

        # מוסיף את משקולות הקצה לסך המשקולות של MST.
        total_weight += weight

        # סמן את הצמתים u ו-v כצמתים מחוברים.
        connected.add(u)
        connected.add(v)

# מציג תוצאות MST.
print('עץ טווח מינימלי:')
for edge in mst:
    print(edge)

# מציג את המשקל הכולל של כל הקצוות שנבחרו.
print('משקל כולל =', total_weight)


# תשובה לניתוח:
# 1. באיזה אלגוריתם משתמשים?
# 2. איזה קצה נבחר?
# 3. מהי העלות הכוללת המינימלית?
# 4. מדוע MST מתאים לשימוש במקרה זה?

# תשובה לניתוח:
# 1. האלגוריתם בו נעשה שימוש הוא Kruskal.
# 2. הקצוות שנבחרו הם (1, 'C', 'D'), (2, 'A', 'C') ו-(3, 'B', 'D').
# 3. העלות הכוללת המינימלית היא 6 (1 + 2 + 3).
# 4. MST מתאים לשימוש במקרה זה מכיוון שאנו רוצים לחבר את כל הצמתים בעלות מינימלית מבלי ליצור מחזור, ולכן MST מספק את הפתרון האופטימלי לבעיה זו.