# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

graph = {
'A': ['B', 'C'],
'B': ['D', 'E'],
'C': ['F'],
'D': [],
'E': [],
'F': []
}

def dfs(graph, node, visited):
    visited.add(node)
    print(node, end=" ")

    for neighbor in graph[node]:
        if neighbor not in visited:
            dfs(graph, neighbor, visited)
visited = set()
print('DFS של A:')
dfs(graph, 'A', visited)

#שאלות ניתוח
#1. מדוע DFS הולך לצומת העמוק ביותר ראשון?
#2. מה קורה אם ישתנה צו השכן?
#3. השווה את התוצאות של DFS עם BFS באותו גרף.

#תשובה:
#1. DFS עובר תחילה לצומת העמוק ביותר מכיוון:
#   - DFS משתמש בגישת "חפש עד מבוי סתום, ואז מסלול אחורה".
#   - בכל פעם שאתה מוצא שכן, עבור ישר לצומת זה (רקורסיה)
#   - אל תפסיק עד שלא יהיו יותר שכנים, אז נסה סניף אחר

#2. אם הסדר השכן שונה:
#   - סדר הביקורים בצמתים ישתנה (מכיוון שסדר השכנים שונה)
#   - אבל בכל הצמתים עדיין מבקרים (כל עוד הגרף מחובר)
#   - דוגמה: אם B בא לפני C, אז עץ ה-D-E ייבדק תחילה

#3. השוואה של DFS לעומת BFS באותו גרף:
#   - BFS: בית → בית ספר, חנות → ספרייה, שוק (רמה לפי רמה)
#   - DFS: בית → בית ספר → ספריה → (מחדש) → חנות → שוק
#   - BFS מתאים יותר לשבילים סמוכים, DFS מתאים יותר לחקר מעמיק