# שם : Muhammad Omar Ibrahim
# מספר סטודנט : J0403251093

graph = {
'בית': ['בית ספר', 'חנות'],
'בית ספר': ['ספריה'],
'חנות': ['שוק'],
'ספריה': [],
'שוק': []
}

from collections import deque
def bfs(graph, start):
    visited = set()
    queue = deque([start])
    visited.add(start)
    while queue:
        node = queue.popleft()
        print(node, end=" ")
        for neighbor in graph[node]:
            if neighbor not in visited:
                visited.add(neighbor)
                queue.append(neighbor)

print('BFS מהבית:')
bfs(graph, 'בית')

#.....................................
#שאלות ניתוח
#1. באיזה צומת מבקרים ראשון?
#2. מדוע BFS מתאים למציאת הנתיב הקרוב?
#3. מה ההבדל בסדר ה-BFS אם מבנה הגרף משתנה?

#תשובה:
#1. הצומת הראשון לביקור הוא 'בית' מכיוון שהוא נקודת ההתחלה.
#   BFS תמיד מתחיל מהצומת שאנו קובעים כתחילת החיפוש.

#2. BFS מתאים למציאת הנתיב הקרוב ביותר מכיוון:
#   - BFS מבקר בצמתים על סמך עומק/מרחק מהצומת ההתחלתי
#   - צמתים קרובים יותר להתחלה יבקרו תחילה
#   - זה מבטיח שהנתיב הראשון שנמצא הוא הנתיב הקצר ביותר

#3. הבדלים בסדר BFS אם מבנה הגרף משתנה:
#   - אם תוסיף/תחסיר קצוות (חיבורים), סדר הביקורים יהיה שונה
#   - אם תשנה את צומת ההתחלה, התוצאות יהיו שונות
#   - אבל העיקרון נשאר זהה: רמה אחר רמה מצומת ההתחלה